
# Plugin specs for Antidote plugin manager. https://antidote.sh

# Prezto modules
# The configuration framework for Zsh. https://github.com/sorin-ionescu/prezto

# Directory. Sets directory options and defines directory aliases.
sorin-ionescu/prezto path:modules/directory/init.zsh

# Environment
# Sets general shell options and defines termcap variables.
sorin-ionescu/prezto path:modules/environment/init.zsh

# History
# Sets history options and defines history aliases.
sorin-ionescu/prezto path:modules/history/init.zsh


# Other

# Command Help. Extract help text from builtin commands and man pages.
# https://github.com/learnbyexample/command_help
learnbyexample/command_help kind:path

# jeffreytse/zsh-vi-mode: A better and friendly vi(vim) mode plugin for ZSH.
# https://github.com/jeffreytse/zsh-vi-mode
jeffreytse/zsh-vi-mode kind:defer

# Zsh-Vi-Man. For best results, source this plugin after zsh-vi-mode:
# https://github.com/TunaCuma/zsh-vi-man
TunaCuma/zsh-vi-man kind:defer

zdharma-continuum/fast-syntax-highlighting kind:defer

zsh-users/zsh-autosuggestions

# Key bindings need to be defined after loading so can't defer.
zsh-users/zsh-history-substring-search


# Completions

# zsh-completions: Additional completion definitions for Zsh.
# https://github.com/clarketm/zsh-completions
zsh-users/zsh-completions kind:fpath path:src
